class GameBuddyApp:
    def __init__():
        pass

    def _build_fastapi():
        """ Инитить фастапи приложение можно тут,
        так у нас получится дополнительный слой абстракции где мы можем инитить БД
        или ещё что то делать и избавимся по ситу от lifespan который выгляит так себе чесговоря) """
        pass

    def setup():
        """ Тут вот можно инитить БД например """
        pass

    def run():
        """ Ну тут понятно) """
        pass

    def shutdown():
        """ А тут закрывать коннекты к БД напрмер """
        pass